app/controllers/carts_controller.rb

SELECT `carts`.* FROM `carts` WHERE `carts`.`id` = 1 LIMIT 1
---
  def show
      begin
          @cart = Cart.find(params[:id])

DELETE FROM `carts` WHERE `carts`.`id` = 2
---
  def destroy
    @cart = current_cart
    @cart.destroy