app/controllers/line_items_controller.rb

SELECT `products`.* FROM `products` WHERE `products`.`id` = 3 ORDER BY title LIMIT 1
INSERT INTO `carts` (`created_at`, `updated_at`) VALUES ('2015-06-30 02:56:31', '2015-06-30 02:56:31')
INSERT INTO `line_items` (`cart_id`, `created_at`, `order_id`, `product_id`, `quantity`, `updated_at`) VALUES (6, '2015-07-02 01:32:37', NULL, 4, 1, '2015-07-02 01:32:37')
UPDATE `line_items` SET `quantity` = 2, `updated_at` = '2015-07-01 01:18:36' WHERE `line_items`.`id` = 6
---
  def create
      @cart = current_cart #这里是调用父控制器的方法
      p = Product.find(params[:product_id])
      @line_item = @cart.add_product(p.id)

      respond_to do |format|
        if @line_item.save