app/controllers/orders_controller.rb

  def index
    @orders = Order.paginate :page => params[:page], :order => 'created_at desc', :per_page => 10
---
SELECT COUNT(*) FROM `orders`
SELECT `orders`.* FROM `orders` ORDER BY created_at desc LIMIT 10 OFFSET 0

  def new
    @cart = current_cart
    if @cart.line_items.empty?
---
SELECT COUNT(*) FROM `line_items` WHERE `line_items`.`cart_id` = 4
SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`cart_id` = 4

  def create
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(current_cart)

    respond_to do |format|
      if @order.save
          Cart.destroy(session[:cart_id])
---
INSERT INTO `orders` (`address`, `created_at`, `email`, `name`, `pay_type`, `updated_at`) VALUES ('北市区莲花路', '2015-07-01 09:14:30', 'bysxrokr@qq.com', '袁帅', 'Credit card', '2015-07-01 09:14:30')
DELETE FROM `carts` WHERE `carts`.`id` = 4