app/controllers/products_controller.rb

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`created_at`, `description`, `image_url`, `price`, `title`, `updated_at`) VALUES ('2015-06-29 07:55:24', '我的phone1', 'sss', 1, 'phone1', '2015-06-29 07:55:24')