app/controllers/store_controller.rb

  def index
      @products = Product.all
---
SELECT `products`.* FROM `products` ORDER BY title

  def show
      @picture = Picture.find(params[:id])
---
SELECT `pictures`.* FROM `pictures` WHERE `pictures`.`id` = 1 LIMIT 1

  def picture
  	@picture = Picture.find(params[:id])
---
SELECT `pictures`.* FROM `pictures` WHERE `pictures`.`id` = 1 LIMIT 1