app/controllers/users_controller.rb

SELECT `users`.* FROM `users` ORDER BY name
---
  def index
    @users = User.order(:name)

INSERT INTO `users` (`created_at`, `hashed_password`, `name`, `salt`, `updated_at`) VALUES ('2015-07-02 03:07:26', '0607176373259958f034a9cf96ca717487331802206e0ac0e567f0ed1646fccf', 'bysxiang', '412043200.9457550179698881', '2015-07-02 03:07:26')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save